In [ ]:
import pandas as pd

In [ ]:
master=pd.read_csv('data/master.csv')

In [ ]:
income=pd.read_csv('data/gdp_iso3.csv')

In [ ]:
income

In [ ]:
income.info()

In [4]:

# 入力ファイル名と出力ファイル名
input_file = 'data/gdp_iso3.csv'
output_file = 'gdp2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

/var/folders/qn/g35trx293n93yxfc9mtdl8cc0000gn/T/ipykernel_65347/3577055600.py:6: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv(input_file)

In [5]:
gdp2=pd.read_csv('gdp2.csv')
gdp2

/var/folders/qn/g35trx293n93yxfc9mtdl8cc0000gn/T/ipykernel_65347/3123064166.py:1: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  gdp2=pd.read_csv('gdp2.csv')

                     country        year value ISO3
0                Afghanistan  Unnamed: 0     0  AFG
1                     Angola  Unnamed: 0     1  AGO
2                    Albania  Unnamed: 0     2  ALB
3                    Andorra  Unnamed: 0     3  AND
4       United Arab Emirates  Unnamed: 0     4  ARE
...                      ...         ...   ...  ...
234775                 Samoa        ISO3   WSM  WSM
234776                 Yemen        ISO3   YEM  YEM
234777          South Africa        ISO3   ZAF  ZAF
234778                Zambia        ISO3   ZMB  ZMB
234779              Zimbabwe        ISO3   ZWE  ZWE

[234780 rows x 4 columns]

In [ ]:
gdp3 = gdp2.drop('country', axis=1)  # 'B'列を削除
gdp3

# カラムの変更
new_column_names = ['year', 'pop', 'ISO3']
gdp3.columns = new_column_names

# 新しいCSVファイルに書き込む
new_csv_file_path = 'newgdp.csv'
gdp3.to_csv(new_csv_file_path, index=False)

In [ ]:
# 入力ファイル名と出力ファイル名
input_file = 'newgdp.csv'
output_file = 'newgdp2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

# pop

In [6]:
pop=pd.read_csv('data/pop_iso3.csv')

In [7]:
pop

       Unnamed: 0               country  year  value ISO3
0               0           Afghanistan  1800  3.28M  AFG
1               1                Angola  1800  1.57M  AGO
2               2               Albania  1800   400k  ALB
3               3               Andorra  1800   2650  AND
4               4  United Arab Emirates  1800  40.2k  ARE
...           ...                   ...   ...    ...  ...
59292       59292                 Samoa  2100   441k  WSM
59293       59293                 Yemen  2100  74.2M  YEM
59294       59294          South Africa  2100  74.6M  ZAF
59295       59295                Zambia  2100  63.6M  ZMB
59296       59296              Zimbabwe  2100  35.6M  ZWE

[59297 rows x 5 columns]

In [8]:


# 入力ファイル名と出力ファイル名
input_file = 'data/pop_iso3.csv'
output_file = 'pop2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

In [9]:
pop2=pd.read_csv('pop2.csv')
pop2

                    country  year  value ISO3
0               Afghanistan  1800  3.28M  AFG
1                    Angola  1800  1.57M  AGO
2                   Albania  1800   400k  ALB
3                   Andorra  1800   2650  AND
4      United Arab Emirates  1800  40.2k  ARE
...                     ...   ...    ...  ...
59292                 Samoa  2100   441k  WSM
59293                 Yemen  2100  74.2M  YEM
59294          South Africa  2100  74.6M  ZAF
59295                Zambia  2100  63.6M  ZMB
59296              Zimbabwe  2100  35.6M  ZWE

[59297 rows x 4 columns]

In [10]:
pop3 = pop2.drop('country', axis=1)  # 'B'列を削除
pop3

# カラムの変更
new_column_names = ['year', 'pop', 'ISO3']
pop3.columns = new_column_names

# 新しいCSVファイルに書き込む
new_csv_file_path = 'newpop.csv'
pop3.to_csv(new_csv_file_path, index=False)

In [13]:
newpop=pd.read_csv('newpop.csv')
newpop

       year    pop ISO3
0      1800  3.28M  AFG
1      1800  1.57M  AGO
2      1800   400k  ALB
3      1800   2650  AND
4      1800  40.2k  ARE
...     ...    ...  ...
59292  2100   441k  WSM
59293  2100  74.2M  YEM
59294  2100  74.6M  ZAF
59295  2100  63.6M  ZMB
59296  2100  35.6M  ZWE

[59297 rows x 3 columns]

In [14]:
# 入力ファイル名と出力ファイル名
input_file = 'newpop.csv'
output_file = 'newpop2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

# life

In [15]:
life=pd.read_csv('data/life_iso3.csv')

In [16]:
life

       Unnamed: 0               country  year  value ISO3
0               0           Afghanistan  1800   28.2  AFG
1               1                Angola  1800   27.0  AGO
2               2               Albania  1800   35.4  ALB
3               3               Andorra  1800    NaN  AND
4               4  United Arab Emirates  1800   30.7  ARE
...           ...                   ...   ...    ...  ...
58690       58690                 Samoa  2100   80.8  WSM
58691       58691                 Yemen  2100   78.0  YEM
58692       58692          South Africa  2100   77.7  ZAF
58693       58693                Zambia  2100   77.1  ZMB
58694       58694              Zimbabwe  2100   74.4  ZWE

[58695 rows x 5 columns]

In [17]:

# 入力ファイル名と出力ファイル名
input_file = 'data/life_iso3.csv'
output_file = 'life2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

In [18]:
life2=pd.read_csv('life2.csv')
life2

                    country  year  value ISO3
0               Afghanistan  1800   28.2  AFG
1                    Angola  1800   27.0  AGO
2                   Albania  1800   35.4  ALB
3                   Andorra  1800    NaN  AND
4      United Arab Emirates  1800   30.7  ARE
...                     ...   ...    ...  ...
58690                 Samoa  2100   80.8  WSM
58691                 Yemen  2100   78.0  YEM
58692          South Africa  2100   77.7  ZAF
58693                Zambia  2100   77.1  ZMB
58694              Zimbabwe  2100   74.4  ZWE

[58695 rows x 4 columns]

In [19]:
life3 = life2.drop('country', axis=1)  # 'B'列を削除
life3

       year  value ISO3
0      1800   28.2  AFG
1      1800   27.0  AGO
2      1800   35.4  ALB
3      1800    NaN  AND
4      1800   30.7  ARE
...     ...    ...  ...
58690  2100   80.8  WSM
58691  2100   78.0  YEM
58692  2100   77.7  ZAF
58693  2100   77.1  ZMB
58694  2100   74.4  ZWE

[58695 rows x 3 columns]

In [20]:
# カラムの変更
new_column_names = ['year', 'life span', 'ISO3']
life3.columns = new_column_names

In [21]:
life3

       year  life span ISO3
0      1800       28.2  AFG
1      1800       27.0  AGO
2      1800       35.4  ALB
3      1800        NaN  AND
4      1800       30.7  ARE
...     ...        ...  ...
58690  2100       80.8  WSM
58691  2100       78.0  YEM
58692  2100       77.7  ZAF
58693  2100       77.1  ZMB
58694  2100       74.4  ZWE

[58695 rows x 3 columns]

In [22]:
# 新しいCSVファイルに書き込む
new_csv_file_path = 'newlife.csv'
life3.to_csv(new_csv_file_path, index=False)

In [23]:
# 入力ファイル名と出力ファイル名
input_file = 'newlife.csv'
output_file = 'newlife2.csv'

# CSVファイルを読み込む
data = pd.read_csv(input_file)

# 0列（左から1列目）を削除
data = data.drop(data.columns[0], axis=1)

# 出力ファイルにデータを書き込む
data.to_csv(output_file, index=False)

In [ ]:
mental=pd.read_csv('data/mental_iso3.csv')

In [ ]:
mental

In [ ]:
continent=pd.read_csv('data/continent.csv')

In [ ]:
continent

In [ ]:
master = master.merge(life2,on=['ISO3','year'],how='left')
#master=master.merge(continent,on=['ISO3','year'],how='left')
#master=master.merge(mental,on=['ISO3','year'],how='left')
master=master.merge(pop2,on=['ISO3','year'],how='left')
master=master.merge(gdp2,on=['ISO3','year'],how='left')

ここより下はマージじゃなくてデータの並び替え

In [ ]:
import pandas as pd

# 同じ階層に変換したいデータを配置
# pop.csvは読み込むファイル名
df = pd.read_csv('data/pop.csv', index_col=None)

# データを縦に並べる
melted_df = df.melt(id_vars='country', var_name='year', value_name='value')

# 書き出すファイルパスを指定（converted_data.csvって名前で出力）
output_path = 'pop_data.csv'

# csvとして出力
melted_df.to_csv(output_path, index=False)

In [ ]:
df = pd.read_csv('data/gdp_iso3.csv', index_col=None)

# データを縦に並べる
melted_df = df.melt(id_vars='country', var_name='year', value_name='value')

# 書き出すファイルパスを指定（converted_data.csvって名前で出力）
output_path = 'gdp_data.csv'

# csvとして出力
melted_df.to_csv(output_path, index=False)

In [ ]:
df = pd.read_csv('data/life ex.csv', index_col=None)

# データを縦に並べる
melted_df = df.melt(id_vars='country', var_name='year', value_name='value')

# 書き出すファイルパスを指定（converted_data.csvって名前で出力）
output_path = 'life_data.csv'

# csvとして出力
melted_df.to_csv(output_path, index=False)